src/test/resources/xml/Request.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <ns2:getBeerRequest xmlns:ns2="http://memorynotfound.com/beer">
            <ns2:id>1</ns2:id>
        </ns2:getBeerRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
